In [16]:
import pandas as pd
import numpy as np

In [2]:
# DataFrame from dict of lists

olympic_data_list={'HostCity':["London","Beijing","Athens","Sydney"],
                   'Year':[2012,2008,2000,1996],
                   'No. of Participating Countries':[205,204,201,200]
                  }

In [3]:
df_olympic_data=pd.DataFrame(olympic_data_list)

In [4]:
df_olympic_data

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2000                             201
3   Sydney  1996                             200

In [5]:
# DataFrame from dict of Dicts

olympic_data_dict={'London':{2012:205}, 'Beijing':{2008:204}}
df_olympic_data_dict=pd.DataFrame(olympic_data_dict)
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [6]:
# viewing a df

df_olympic_data.HostCity

0     London
1    Beijing
2     Athens
3     Sydney
Name: HostCity, dtype: object

In [7]:
df_olympic_data.describe

<bound method NDFrame.describe of   HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2000                             201
3   Sydney  1996                             200>

In [8]:
# Df from dict of Series

series1_olympic_participation=pd.Series([205,204,210,200], index=[2012,2008,2000,1996])


series2_olympic_country=pd.Series(['London',"Beijing","Athens","Sydney"], index=[2012,2008,2000,1996])

In [9]:
series2_olympic_country=pd.Series(['London',"Beijing",'Athens','Sydney'],index=[2012,2008,2000,1996])

In [10]:
df_series=pd.DataFrame({'No. of Participating Countries':series1_olympic_participation,
                      'Host City':series2_olympic_country})

In [17]:
# df from dict of nd arrays

np_array=np.array([2012,2008,2004,2006])
dict_np_array={'year':np_array}
df_nparray=pd.DataFrame(dict_np_array)
df_nparray

   year
0  2012
1  2008
2  2004
3  2006

In [11]:
df_series

      No. of Participating Countries Host City
2012                             205    London
2008                             204   Beijing
2000                             210    Athens
1996                             200    Sydney

In [13]:
df_olympic_data

  HostCity  Year  No. of Participating Countries
0   London  2012                             205
1  Beijing  2008                             204
2   Athens  2000                             201
3   Sydney  1996                             200

In [14]:
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

In [15]:
df_series

      No. of Participating Countries Host City
2012                             205    London
2008                             204   Beijing
2000                             210    Athens
1996                             200    Sydney